function analyze() {
  const text = document.getElementById('Input').value.toLowerCase();
  const letters = {
    "1f%": "a",
    "2f%": "b",
    "3f%": "c",
    "4f%": "d",
    "5f%": "e",
    "6f%": "f",
    "7f%": "g",
    "8f%": "h",
    "9f%": "i",
    "10f%": "j",
    "11f%": "k",
    "12f%": "l",
    "13f%": "m",
    "14f%": "n",
    "15f%": "o",
    "16f%": "p",
    "17f%": "q",
    "18f%": "r",
    "19f%": "s",
    "20f%": "t",
    "21f%": "u",
    "22f%": "v",
    "23f%": "w",
    "24f%": "x",
    "25f%": "y",
    "26f%": "z",
    "27f%": "1",
    "28f%": "2",
    "29f%": "3",
    "30f%": "4",
    "31f%": "5",
    "32f%": "6",
    "33f%": "7",
    "34f%": "8",
    "35f%": "9",
    "36f%": "0",
    "37f%": "'",
    "38f%": "=",
    "39f%": "+",
    "40f%": "-",
    "41f%": "(",
    "42f%": ")",
    "43f%": ":",
    "44f%": ";",
    "45f%": "!",
    "46f%": "?",
    "47f%": "@",
    "48f%": "#",
    "49f%": "%",
    "50f%": "$",
    "51f%": "{",
    "52f%": "}",
    "53f%": "_",
    "54f%": "أ",
    "55f%": "ب",
    "56f%": "ت",
    "57f%": "ث",
    "58f%": "ج",
    "59f%": "ح",
    "60f%": "خ",
    "61f%": "د",
    "62f%": "ذ",
    "63f%": "ر",
    "64f%": "ز",
    "65f%": "س",
    "66f%": "ش",
    "67f%": "ص",
    "68f%": "ض",
    "69f%": "ط",
    "70f%": "ظ",
    "71f%": "ع",
    "72f%": "غ",
    "73f%": "ف",
    "74f%": "ق",
    "75f%": "ك",
    "76f%": "ل",
    "77f%": "م",
    "78f%": "ن",
    "79f%": "ه",
    "80f%": "و",
    "81f%": "ي",    
    "82f%": ".",
    "83f%": ",",
     "0f%": " "
  };

  let dis = "";
  const regex = /(\d{1,2}f%)/g;
  const codes = text.match(regex);

  if (!codes) {
    dis = "#!";
  } else {
    for (let code of codes) {
      if (letters[code]) {
        dis += letters[code];
      } else if (letters === " "){
        dis += " ";
      }
      else {
        dis += "#!";
      }
    }
  }

  document.getElementById("result").innerHTML = dis;
}




// les espase mamgadch
